{
  "About": {
    "name": "Евгений Згирдан",
    "profession": "Фронтенд разработчик",
    "title": "About",
    "aboutMe": "Проектирую и реализую понятные и стильные UI-решения для веб-приложений.",
    "first": "В 2020 году я начал изучать разработку пользовательских интерфейсов, что быстро переросло в глубокую страсть к программированию и веб-технологиям. С тех пор мне удалось поработать как в",
    "agency": "цифровом агентстве",
    "and": "так и в",
    "company": "крупной компании",
    "afterCompanies": ", получив ценный опыт создания интуитивно понятных решений, ориентированных на пользователей.",
    "focus": "Сегодня я сосредоточен на развитии своих навыков фронтенд-разработка и поиске команды, которая ценит сотрудничество, инновации и развитие.",
    "dreamTeamTitle": "Как выглядит моя команда мечты?",
    "dreamTeam1": "Это команда увлечённых, высококвалифицированных специалистов, которые стремятся к инновациям и постоянно расширяют границы знаний в фронтенде. Они ценят сотрудничество, поддерживают друг друга и открыты к обмену идеями и совместному решению задач.",
    "dreamTeam2": "Идеальная команда также придаёт большое значение постоянному обучению и развитию, использует современные технологии и идёт в ногу с отраслевыми трендами. Разнообразие — это ключевая ценность: разные бэкграунды и взгляды помогают создавать выдающийся пользовательский опыт.",
    "dreamTeam3": "Мы работаем над значимыми и захватывающими проектами, которые действительно улучшают жизнь пользователей. Главное — это позитивная, творческая и вдохновляющая среда, где ценят вклад каждого и стремятся к совершенству в создании первоклассных решений.",
    "whyChangeTitle": "Почему я ищу новую команду?",
    "reason1": "Я решил уйти с предыдущей работы, чтобы сосредоточиться на личностном и профессиональном росте. Хочу расширить кругозор, принять новые вызовы и продолжить развиваться как фронтенд-разработчик.",
    "reason2": "Решение было обусловлено отсутствием перспектив роста в прежней компании. Сейчас я ищу роль, в которой смогу вносить значимый вклад и при этом получать поддержку в своих амбициях — желательно в команде, работающей над инновационными и целенаправленными проектами."
  },
  "Menu": {
    "about": "Обо мне",
    "experience": "Опыт",
    "interesting_experience": "Интересные кейсы",
    "projects": "Проекты"
  },
  "Resume": {
    "resume": "Скачать резюме",
    "viewResume": "Посмотреть резюме"
  },
  "Experience": {
    "dex": {
      "date": "Август 2024 — по настоящее время",
      "position": "Фронтенд-разработчик",
      "description": [
        "Поддержка и развитие нескольких проектов: исправление ошибок, улучшение функциональности и разработка новых фич",
        "Инициировал разработку двух проектов, подобрал необходимые технологии",
        "Успешно перенёс встроенный чат на новую архитектуру на базе Matrix Synapse",
        "Обновлял зависимости до последних версий для повышения безопасности и стабильности",
        "Интеграция TypeScript: улучшил читаемость кода, упростил рефакторинг и сократил количество ошибок",
        "Оптимизация размера бандла для ускорения загрузки страниц",
        "Реализовал современную архитектуру (FSD), сделал проект более масштабируемым",
        "Оказывал помощь и проводил код-ревью для младших разработчиков в команде",
        "Использование Zustand для лёгкого и эффективного управления локальным состоянием",
        "Улучшение Developer Experience : настройка линтеров, форматтеров и автоматизация процессов разработки"
      ]
    },
    "aeroidea": {
      "date": "Октябрь 2022 — Июнь 2024",
      "position": "Фронтенд-разработчик",
      "description": [
        "Разработал аудиоплеер для материалов по изучению языков",
        "Реализовал инструменты автогенерации кода для ускорения разработки",
        "Добавил UI-компоненты в Storybook и задокументировал их",
        "Учитывал потребности пользователей с ограниченными возможностями: реализовал темы с высоким контрастом, увеличением шрифта и расстояния между буквами",
        "Писал unit-тесты для обеспечения надёжности компонентов",
        "Создал слайдер карточек с поддержкой медиа и пользовательским контентом",
        "Оказывал помощь и проводил код-ревью для младших разработчиков в команде",
        "Провёл тонкую настройку кеширования для ускорения загрузки страниц"
      ]
    }
  },
  "Projects": {
    "webcv": {
      "name": "WebCV",
      "description": "Интерактивное портфолио, созданное для демонстрации моих навыков фронтенд-разработки: чистый интерфейс, анимированные переходы, структурированные блоки — образование, опыт, технологии и проекты."
    },
    "spartak": {
      "name": "Спартак",
      "description": "Многофункциональная платформа футбольного клуба «Спартак» (Москва), объединяющая болельщиков с командой. Актуальные новости, магазин с мерчем, академия, покупка билетов, голосование и специальные предложения."
    },
    "prosv": {
      "name": "Просвещение",
      "description": "Лидер в сфере комплексных решений для образования, развития и досуга, создающий ценности и возможности для реализации потенциала."
    },
    "maxmodal": {
      "name": "MaxModal",
      "description": "MaxModal — логистическая и морская транспортная компания, специализирующаяся на контейнерных перевозках и мультимодальных маршрутах (море, ж/д, авто). Основной фокус — оптимизация доставки за счёт разных типов транспорта."
    },
    "name": "Евгений Згирдан",
    "allProjects": "Посмотреть все проекты"
  },
  "Interesting_exp": {
    "title": "Интересный опыт",
    "intro": "Во время работы в «Aero idea» и «Dex technologies» я столкнулся с рядом нестандартных и интересных задач, требующих творческого подхода и глубоких знаний фронтенда.",
    "conclusion": "Этот опыт не только расширил мои навыки и знания в frontend-разработке, но и научил решать сложные задачи, эффективно работать в команде и находить креативные решения.",
    "list": {
      "maxmodal": "Проект «MaxModal»: Заменил устаревший внутренний чат на базе Jabber на Matrix Synapse. Интегрировал новую систему без потери существующего функционала, включая уведомления. Глубоко погрузился в протокол Matrix.",
      "launch": "Опыт запуска проектов: Самостоятельно инициировал новые проекты с нуля, подбирал стек технологий, настраивал окружение и взаимодействовал с DevOps для деплоя на dev и production. Получил опыт контейнерезации React приложений в Docker контейнере для упрощения развертывания и обеспечения согласованности среды.",
      "prosv": "Проект «Группа Просвещение»: Реализовал аудиораздел с аудиоплеером, для языковых учебников с фильтрацией по языкам, списками учебников и детальными страницами. Пользователи могут выбирать класс и прослушивать материалы через встроенный аудиоплеер."
    }
  },
  "Locale": {
    "ru": "Ру",
    "en": "Ен",
    "locale": "{locale, select, ru {Рус} en {Англ} other {Unknown}}"
  }
}